avnet-iotconnect/avnet-iotc-mtb-psoc-edge-aivision-webrtc/proj_cm33_ns/webrtc/signaling.c
/* SPDX-License-Identifier: MIT
 * Copyright (C) 2026 Avnet
 * Authors: Nikola Markovic <nikola.markovic@avnet.com> et al.
 */

/*
 * Signaling layer.
 *
 * Step 5a (GetSignalingChannelEndpoint, REST), Step 5b URL signing
 * (signaling_build_signed_viewer_url) and the WSS upgrade handshake
 * (signaling_connect / signaling_disconnect) are implemented. WS frame
 * exchange (wait_for_offer / send_answer) is still stubbed — wslay glue
 * is the next session.
 *
 * GetSignalingChannelEndpoint flow:
 *   1. Signaling_ConstructGetSignalingChannelEndpointRequest  — builds URL + body
 *   2. SigV4_GenerateHTTPAuthorization                       — builds Authorization header
 *   3. iotconnect_https_request_with_opts                    — POST, returns JSON
 *   4. Signaling_ParseGetSignalingChannelEndpointResponse    — extracts WSS endpoint
 *
 * ConnectAsViewer URL-signing flow (signaling_build_signed_viewer_url):
 *   1. Signaling_ConstructConnectWssEndpointRequest  — builds the unsigned base URL
 *   2. Build canonical query string with X-Amz-* params (URI-encoded, lex-sorted)
 *   3. SigV4_GenerateHTTPAuthorization                — signs the canonical request
 *   4. Append &X-Amz-Signature=<sig> to the query
 */

#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include <time.h>

#include "FreeRTOS.h"
#include "task.h"

#include "mbedtls/base64.h"
#include "mbedtls/sha1.h"
#include "mbedtls/sha256.h"

#include "sigv4.h"
#include "signaling_api.h"

#include "iotcl_certs.h"
#include "iotcl_dra_url.h"
#include "iotc_http_client.h"

#include "cy_tcpip_port_secure_sockets.h"
#include "transport_interface.h"

#include "webrtc/csprng.h"
#include "webrtc/signaling.h"

// -------------------------------------------------------------------------
// Buffer sizes
// -------------------------------------------------------------------------

// Full URL from the Signaling lib.
// 5a (HTTPS): "https://kinesisvideo.<region>.amazonaws.com/..." — ~80 chars.
// 5b base URL (WSS): "wss://<host>?X-Amz-ChannelARN=<arn>&X-Amz-ClientId=<id>"
// Host ~50, ARN ~110, client_id up to ~64 → up to ~280. 384 leaves comfortable room.
#define SIG_URL_BUF         384

// JSON body for GetSignalingChannelEndpoint — ARN + protocol/role fields.
// ARN is ~80 chars; total body is well under 512.
#define SIG_BODY_BUF        512

// ISO 8601 date: "YYYYMMDDTHHMMSSz" — exactly 16 chars + null.
#define SIG_DATE_ISO_LEN    17

// Authorization header value output from SigV4_GenerateHTTPAuthorization.
// "AWS4-HMAC-SHA256 Credential=.../kinesisvideo/aws4_request, SignedHeaders=..., Signature=<64>"
// Real KVS values run ~380-450 chars; 1024 leaves comfortable headroom.
#define SIG_AUTH_BUF        1024

// KVS service name for SigV4.
#define KVS_SERVICE         "kinesisvideo"
#define KVS_SERVICE_LEN     (sizeof(KVS_SERVICE) - 1)

// Overhead bytes in the canonical headers string beyond the three variable
// fields (host, date, token): field names + colons + newlines + null.
// "host:\nx-amz-date:\nx-amz-security-token:\n\0" = ~57 chars; 64 is safe.
#define SIG_CANON_HDR_OVERHEAD 64

// File-scope statics for predictable-size scratch used inside
// signaling_resolve_endpoint. One call at a time (single WebRTC task).
static char s_url_buf[SIG_URL_BUF];
static char s_body_buf[SIG_BODY_BUF];
// SigV4_GenerateHTTPAuthorization treats authBufLen as in/out: input is capacity,
// output is bytes actually written (always <= capacity). We pass SIG_AUTH_BUF in,
// then null-terminate at the returned length — the +1 byte covers the case where
// SigV4 fills the buffer completely and we still need somewhere for the '\0'.
static char s_auth_buf[SIG_AUTH_BUF + 1];
static mbedtls_sha256_context s_sha_ctx;

// -------------------------------------------------------------------------
// mbedTLS SHA-256 callbacks (same pattern as webrtc_smoke_test.c)
// -------------------------------------------------------------------------

static int32_t sha256_init_cb(void *ctx) {
    mbedtls_sha256_init((mbedtls_sha256_context *) ctx);
    return mbedtls_sha256_starts((mbedtls_sha256_context *) ctx, 0);
}

static int32_t sha256_update_cb(void *ctx, const uint8_t *in, size_t len) {
    return mbedtls_sha256_update((mbedtls_sha256_context *) ctx, in, len);
}

static int32_t sha256_final_cb(void *ctx, uint8_t *out, size_t outlen) {
    (void) outlen;
    return mbedtls_sha256_finish((mbedtls_sha256_context *) ctx, out);
}


// -------------------------------------------------------------------------
// Helpers
// -------------------------------------------------------------------------

// Format the current UTC time as ISO 8601 for SigV4 ("YYYYMMDDTHHMMSSz").
// Writes exactly 16 chars + null terminator into buf[SIG_DATE_ISO_LEN].
static void format_iso8601_now(char buf[SIG_DATE_ISO_LEN]) {
    time_t now = time(NULL);
    struct tm t;
    gmtime_r(&now, &t);
    strftime(buf, SIG_DATE_ISO_LEN, "%Y%m%dT%H%M%SZ", &t);
}

int signaling_resolve_endpoint(const AwsCreds *creds, char *out_endpoint, size_t cap) {
    if (NULL == creds || NULL == out_endpoint || 0 == cap) {
        return -1;
    }

    // 1. Build URL + body via the Signaling library.
    SignalingAwsRegion_t region = {
        .pAwsRegion      = creds->region,
        .awsRegionLength = strlen(creds->region),
    };
    GetSignalingChannelEndpointRequestInfo_t req_info = {
        .channelArn = {
            .pChannelArn      = creds->channel_arn,
            .channelArnLength = strlen(creds->channel_arn),
        },
        .protocols = SIGNALING_PROTOCOL_WEBSOCKET_SECURE,
        .role      = SIGNALING_ROLE_VIEWER,
    };
    SignalingRequest_t sig_req = {
        .pUrl       = s_url_buf,
        .urlLength  = sizeof(s_url_buf),
        .pBody      = s_body_buf,
        .bodyLength = sizeof(s_body_buf),
    };

    SignalingResult_t sig_rc = Signaling_ConstructGetSignalingChannelEndpointRequest(
        &region, &req_info, &sig_req
    );
    if (SIGNALING_RESULT_OK != sig_rc) {
        printf("[signaling] ConstructGetSignalingChannelEndpointRequest failed: %d\n", (int) sig_rc);
        return -1;
    }
    // urlLength and bodyLength are now the actual written lengths (no null).
    // s_url_buf and s_body_buf are null-terminated by snprintf inside the lib.

    // 2. Parse host and resource path from the URL via the DRA URL module.
    //    IotclDraUrlContext malloc's the hostname and a copy of the URL.
    //    Zero-initialise so deinit is safe even if init fails.
    IotclDraUrlContext url_ctx = {0};
    if (0 != iotcl_dra_url_init(&url_ctx, s_url_buf)) {
        printf("[signaling] failed to parse URL from signaling lib: %s\n", s_url_buf);
        return -1;
    }
    const char *host = iotcl_dra_url_get_hostname(&url_ctx);
    const char *path = iotcl_dra_url_get_resource(&url_ctx);
    if (NULL == host || NULL == path) {
        printf("[signaling] URL missing host or path: %s\n", s_url_buf);
        iotcl_dra_url_deinit(&url_ctx);
        return -1;
    }

