avnet-iotconnect/avnet-iotc-mtb-psoc-edge-aivision-webrtc/proj_cm33_ns/webrtc/signaling.c
// Append a URI-encoded value to a write cursor using SigV4_EncodeURI.
// encode_slash=true (RFC 3986 "encode all reserved chars in values").
static int append_uri_encoded(char **cur, size_t *remain, const char *value, size_t value_len) {
    size_t encoded_len = *remain;
    SigV4Status_t rc = SigV4_EncodeURI(value, value_len, *cur, &encoded_len, true, false);
    if (SigV4Success != rc) {
        return -1;
    }
    *cur += encoded_len;
    *remain -= encoded_len;
    return 0;
}

// Strip the "wss://" or "https://" scheme from an endpoint URL. Returns a
// pointer into the input string just past the scheme delimiter.
static const char *strip_scheme(const char *url) {
    const char *p = strstr(url, "://");
    return (NULL == p) ? url : (p + 3);
}

int signaling_build_signed_viewer_url(
    const AwsCreds *creds,
    const char *wss_endpoint,
    char *out_url,
    size_t cap
) {
    if (NULL == creds || NULL == wss_endpoint || NULL == out_url || 0 == cap) {
        return -1;
    }
    if (NULL == creds->client_id || '\0' == creds->client_id[0]) {
        printf("[signaling] missing client_id for X-Amz-ClientId\n");
        return -1;
    }
    if (NULL == creds->session_token) {
        // STS triplet from /IOTCONNECT always includes a session token. If
        // it's missing something has gone wrong upstream; fail loudly.
        printf("[signaling] missing session token\n");
        return -1;
    }

    // 1. Build the unsigned base URL via the Signaling lib. Same idiom as
    //    signaling_resolve_endpoint — keeps the URL skeleton lib-blessed.
    SignalingChannelEndpoint_t wss_ep = {
        .pEndpoint      = (char *) wss_endpoint,
        .endpointLength = strlen(wss_endpoint),
    };
    ConnectWssEndpointRequestInfo_t wss_info = {
        .channelArn = {
            .pChannelArn      = creds->channel_arn,
            .channelArnLength = strlen(creds->channel_arn),
        },
        .role           = SIGNALING_ROLE_VIEWER,
        .pClientId      = creds->client_id,
        .clientIdLength = strlen(creds->client_id),
    };
    SignalingRequest_t sig_req = {
        .pUrl       = s_url_buf,
        .urlLength  = sizeof(s_url_buf),
        .pBody      = NULL,
        .bodyLength = 0,
    };
    SignalingResult_t sig_rc = Signaling_ConstructConnectWssEndpointRequest(
        &wss_ep, &wss_info, &sig_req
    );
    if (SIGNALING_RESULT_OK != sig_rc) {
        printf("[signaling] ConstructConnectWssEndpointRequest failed: %d\n", (int) sig_rc);
        return -1;
    }

    // 2. Pull the bare host (no scheme) from the base URL. The lib output is
    //    "wss://<host>?X-Amz-ChannelARN=...&X-Amz-ClientId=..." — the host is
    //    everything between "://" and '?'. We need it for the SigV4 host header
    //    *and* for the final "wss://<host>/?<query>" composition.
    const char *host_start = strip_scheme(s_url_buf);
    const char *host_end   = strchr(host_start, '?');
    if (NULL == host_end) {
        printf("[signaling] base URL missing '?': %s\n", s_url_buf);
        return -1;
    }
    size_t host_len = (size_t)(host_end - host_start);
    if (0 == host_len) {
        printf("[signaling] empty host in base URL\n");
        return -1;
    }

    // 3. ISO 8601 date.
    char date_iso[SIG_DATE_ISO_LEN];
    format_iso8601_now(date_iso);

    // 4. Build the canonical query string directly into out_url. The query
    //    starts after "wss://<host>/?" — we'll prepend that prefix in step 8.
    //    For now write the query bytes starting at out_url + 0; we shift them
    //    later to make room for the prefix. Cleaner than a separate buffer.
    //    Order is lex-sorted (SigV4 requirement when QUERY_IS_CANONICAL is set):
    //      X-Amz-Algorithm, X-Amz-ChannelARN, X-Amz-ClientId, X-Amz-Credential,
    //      X-Amz-Date, X-Amz-Expires, X-Amz-Security-Token, X-Amz-SignedHeaders.
    char *q_cur = out_url;
    size_t q_remain = cap;

    if (0 != append_literal(&q_cur, &q_remain, "X-Amz-Algorithm=AWS4-HMAC-SHA256")) goto buf_too_small;

    if (0 != append_literal(&q_cur, &q_remain, "&X-Amz-ChannelARN=")) goto buf_too_small;
    if (0 != append_uri_encoded(&q_cur, &q_remain, creds->channel_arn, strlen(creds->channel_arn))) goto enc_fail;

    if (0 != append_literal(&q_cur, &q_remain, "&X-Amz-ClientId=")) goto buf_too_small;
    if (0 != append_uri_encoded(&q_cur, &q_remain, creds->client_id, strlen(creds->client_id))) goto enc_fail;

    // X-Amz-Credential = "<AKID>/<YYYYMMDD>/<region>/kinesisvideo/aws4_request"
    if (0 != append_literal(&q_cur, &q_remain, "&X-Amz-Credential=")) goto buf_too_small;
    {
        // Build the credential scope string in a small scratch (~120 chars max:
        // AKID 32 + 8-char date + region ~16 + service 12 + suffix 13 + 4 slashes).
        char cred_scope[160];
        int n = snprintf(cred_scope, sizeof(cred_scope),
            "%s/%.8s/%s/" KVS_SERVICE "/aws4_request",
            creds->access_key_id, date_iso, creds->region
        );
        if (n <= 0 || (size_t) n >= sizeof(cred_scope)) {
            printf("[signaling] credential scope overflow\n");
            return -1;
        }
        if (0 != append_uri_encoded(&q_cur, &q_remain, cred_scope, (size_t) n)) goto enc_fail;
    }

    if (0 != append_literal(&q_cur, &q_remain, "&X-Amz-Date=")) goto buf_too_small;
    if (0 != append_uri_encoded(&q_cur, &q_remain, date_iso, strlen(date_iso))) goto enc_fail;

    // 604800 s = 7 days, the AWS-documented max for presigned URLs. Long-lived
    // by design — the WSS connection itself outlives any single signaling
    // exchange and we don't want a 1-h URL signature expiring mid-session.
    if (0 != append_literal(&q_cur, &q_remain, "&X-Amz-Expires=604800")) goto buf_too_small;

    if (0 != append_literal(&q_cur, &q_remain, "&X-Amz-Security-Token=")) goto buf_too_small;
    if (0 != append_uri_encoded(&q_cur, &q_remain, creds->session_token, strlen(creds->session_token))) goto enc_fail;

    if (0 != append_literal(&q_cur, &q_remain, "&X-Amz-SignedHeaders=host")) goto buf_too_small;

    size_t query_len = (size_t)(q_cur - out_url);

    // 5. Build the headers in plain HTTP form ("host: <host>\r\n") and let
    //    SigV4 do the canonicalization itself. The HEADERS_ARE_CANONICAL path
    //    requires the caller to also emit the empty-line separator between
    //    canonical headers and signed-headers in the canonical request — the
    //    SigV4 lib doesn't add it when the flag is set. Dropping the flag
    //    sidesteps that footgun and matches the working KVS reference.
    char hdr_buf[80];
    int hdr_len = snprintf(hdr_buf, sizeof(hdr_buf), "host: %.*s\r\n", (int) host_len, host_start);
    if (hdr_len <= 0 || (size_t) hdr_len >= sizeof(hdr_buf)) {
        printf("[signaling] hdr_buf overflow (host_len=%d)\n", (int) host_len);
        return -1;
    }

    // 6. Sign with SigV4. QUERY_IS_CANONICAL tells SigV4 to take our query
    //    bytes verbatim (don't re-canonicalize). We deliberately do NOT set
    //    IS_PRESIGNED_URL: AWS KVS-WebRTC accepts standard SigV4 presigned
    //    URLs where the payload hash is SHA256("") (empty payload) rather
    //    than the "UNSIGNED-PAYLOAD" literal — this matches the working KVS
    //    reference port. Setting IS_PRESIGNED_URL forced "UNSIGNED-PAYLOAD"
    //    into the canonical request, which produced a signature AWS rejected
    //    with HTTP 403.
    SigV4CryptoInterface_t crypto = {
        .hashInit      = sha256_init_cb,
        .hashUpdate    = sha256_update_cb,
        .hashFinal     = sha256_final_cb,
        .pHashContext  = &s_sha_ctx,
        .hashBlockLen  = 64,
        .hashDigestLen = 32,
    };
    SigV4Credentials_t sigv4_creds = {
        .pAccessKeyId       = creds->access_key_id,
        .accessKeyIdLen     = strlen(creds->access_key_id),
        .pSecretAccessKey   = creds->secret_access_key,
        .secretAccessKeyLen = strlen(creds->secret_access_key),
    };
    SigV4HttpParameters_t http_params = {
        .pHttpMethod   = "GET",
        .httpMethodLen = 3,
        .flags         = SIGV4_HTTP_QUERY_IS_CANONICAL_FLAG,
        .pPath      = "/",
        .pathLen    = 1,
        .pQuery     = out_url,
        .queryLen   = query_len,
        .pHeaders   = hdr_buf,
        .headersLen = (size_t) hdr_len,
        .pPayload   = NULL,
        .payloadLen = 0,
    };
    SigV4Parameters_t sigv4_params = {
        .pCredentials     = &sigv4_creds,
        .pDateIso8601     = date_iso,
        .pAlgorithm       = NULL,
        .algorithmLen     = 0,
        .pRegion          = creds->region,
        .regionLen        = strlen(creds->region),
        .pService         = KVS_SERVICE,
        .serviceLen       = KVS_SERVICE_LEN,
        .pCryptoInterface = &crypto,
        .pHttpParameters  = &http_params,
    };
    size_t auth_buf_len = SIG_AUTH_BUF;
    char *sig_ptr = NULL;
    size_t sig_len = 0;
    SigV4Status_t sv4_rc = SigV4_GenerateHTTPAuthorization(
        &sigv4_params, s_auth_buf, &auth_buf_len, &sig_ptr, &sig_len
    );
    if (SigV4Success != sv4_rc) {
        printf("[signaling] SigV4_GenerateHTTPAuthorization failed: %d\n", (int) sv4_rc);
        return -1;
    }

    // 7. Append "&X-Amz-Signature=<sig>" to the query (sig is already hex-encoded).
    if (0 != append_literal(&q_cur, &q_remain, "&X-Amz-Signature=")) goto buf_too_small;
    if (sig_len >= q_remain) goto buf_too_small;
    memcpy(q_cur, sig_ptr, sig_len);
    q_cur += sig_len;
    q_remain -= sig_len;
    query_len = (size_t)(q_cur - out_url);

    // 8. Compose final URL: shift the query right to make room for
    //    "wss://<host>/?" prefix, then write the prefix at the start.
    //    Prefix length = strlen("wss://") + host_len + strlen("/?") = 8 + host_len.
    size_t prefix_len = 8 + host_len;
    if (query_len + prefix_len + 1 > cap) {
        goto buf_too_small;
    }
    memmove(out_url + prefix_len, out_url, query_len);
    memcpy(out_url, "wss://", 6);
    memcpy(out_url + 6, host_start, host_len);
    out_url[6 + host_len]     = '/';
    out_url[6 + host_len + 1] = '?';
    out_url[prefix_len + query_len] = '\0';

