avnet-iotconnect/avnet-iotc-mtb-psoc-edge-aivision-webrtc/proj_cm33_ns/webrtc/signaling.c
    printf("[signaling] presigned viewer URL ready (%d bytes)\n", (int)(prefix_len + query_len));
    return 0;

buf_too_small:
    printf("[signaling] presigned URL buffer too small (cap=%d)\n", (int) cap);
    return -1;
enc_fail:
    printf("[signaling] URI-encoding failed building presigned URL\n");
    return -1;
}

// -------------------------------------------------------------------------
// Step 5b — WSS handshake (HTTP/1.1 Upgrade)
// -------------------------------------------------------------------------
//
// We hand-roll the upgrade request and response parse rather than dragging in
// coreHTTP. The wire shape is small and well-defined; see RFC 6455 §1.3 / §4.
// After the 101 response is verified, the next session hands the still-open
// NetworkContext_t to wslay for frame I/O.
//
// Today's signaling_connect() opens the TLS connection, runs the upgrade,
// verifies Sec-WebSocket-Accept, then tears down. This proves the transport
// path end-to-end ahead of wiring wslay.

#define WSS_PORT                    443
#define WSS_RFC6455_GUID            "258EAFA5-E914-47DA-95CA-C5AB0DC85B11"
#define WSS_NONCE_LEN               16
#define WSS_NONCE_B64_LEN           25  /* base64(16) = 24 + null */
#define WSS_ACCEPT_B64_LEN          29  /* base64(SHA1=20) = 28 + null */

// Send/receive timeouts for the upgrade handshake (ms). The handshake is a
// single round-trip — if AWS doesn't respond in 5 s something is wrong.
#define WSS_HANDSHAKE_SEND_TIMEOUT  5000U
#define WSS_HANDSHAKE_RECV_TIMEOUT  5000U

// Fixed overhead in the upgrade request: method/version/literal headers/CRLFs.
// "GET  HTTP/1.1\r\n" + Host: \r\n + Upgrade: websocket\r\n + Connection: Upgrade\r\n
// + Sec-WebSocket-Key: <24>\r\n + Sec-WebSocket-Version: 13\r\n + \r\n. ~150 bytes;
// 256 leaves headroom for accidental drift in the header set.
#define WSS_REQ_FIXED_OVERHEAD      256

// Response head only — we read until "\r\n\r\n" then stop. AWS' 101 response
// is ~200 bytes (a handful of headers); 1 KB is generous.
#define WSS_RESP_BUF_LEN            1024


struct SignalingCtx {
    NetworkContext_t net_ctx;
    bool connected;
};

static struct SignalingCtx g_sig;

// Split a "wss://<host>/<path-and-query>" URL into a malloc'd host and a
// path pointer (into the original buffer, after the host). On success the
// caller must free *out_host. Returns 0 on success, -1 on malformed URL.
static int wss_url_split(const char *url, char **out_host, const char **out_path) {
    if (0 != strncmp(url, "wss://", 6)) {
        printf("[signaling] not a wss:// URL\n");
        return -1;
    }
    const char *host_start = url + 6;
    const char *path_start = strchr(host_start, '/');
    if (NULL == path_start) {
        printf("[signaling] wss URL missing path\n");
        return -1;
    }
    size_t host_len = (size_t)(path_start - host_start);
    if (0 == host_len) {
        printf("[signaling] wss URL has empty host\n");
        return -1;
    }
    char *host = malloc(host_len + 1);
    if (NULL == host) {
        return -1;
    }
    memcpy(host, host_start, host_len);
    host[host_len] = '\0';
    *out_host = host;
    *out_path = path_start;
    return 0;
}

// Compute the expected Sec-WebSocket-Accept value: base64(SHA1(client_key + GUID)).
// out must be at least WSS_ACCEPT_B64_LEN. Returns 0 on success.
static int wss_compute_accept(const char *client_key_b64, char *out, size_t out_size) {
    unsigned char concat[WSS_NONCE_B64_LEN - 1 + sizeof(WSS_RFC6455_GUID) - 1];
    size_t key_len = strlen(client_key_b64);
    if (key_len + sizeof(WSS_RFC6455_GUID) - 1 > sizeof(concat)) {
        return -1;
    }
    memcpy(concat, client_key_b64, key_len);
    memcpy(concat + key_len, WSS_RFC6455_GUID, sizeof(WSS_RFC6455_GUID) - 1);

    unsigned char sha1[20];
    if (0 != mbedtls_sha1(concat, key_len + sizeof(WSS_RFC6455_GUID) - 1, sha1)) {
        return -1;
    }
    size_t out_len = 0;
    if (0 != mbedtls_base64_encode((unsigned char *) out, out_size, &out_len, sha1, sizeof(sha1))) {
        return -1;
    }
    return 0;
}

// Read response head into resp_buf until "\r\n\r\n" or buffer full / timeout.
// Returns the number of bytes read on success, -1 on error. The buffer is NOT
// null-terminated by this function; caller does that using the returned length.
static int wss_recv_head(NetworkContext_t *net, uint8_t *resp_buf, size_t resp_cap) {
    size_t total = 0;
    // Look for "\r\n\r\n" — the four-byte head terminator. Since each
    // cy_awsport_network_receive call returns whatever happened to arrive,
    // we may need several.
    while (total < resp_cap) {
        int32_t n = cy_awsport_network_receive(net, resp_buf + total, resp_cap - total);
        if (n < 0) {
            printf("[signaling] cy_awsport_network_receive failed: %d\n", (int) n);
            return -1;
        }
        if (0 == n) {
            printf("[signaling] WSS upgrade recv timeout\n");
            return -1;
        }
        total += (size_t) n;
        if (total >= 4) {
            for (size_t i = 0; i + 3 < total; i++) {
                if (resp_buf[i]   == '\r' && resp_buf[i+1] == '\n'
                 && resp_buf[i+2] == '\r' && resp_buf[i+3] == '\n') {
                    return (int) total;
                }
            }
        }
    }
    printf("[signaling] WSS upgrade response head exceeded %d bytes\n", (int) resp_cap);
    return -1;
}

// Find a header line "<name>:" in the response (case-insensitive) and return a
// pointer to the value (skipping the colon and any leading whitespace), with
// *out_value_len set to the value length up to the line's CRLF. Returns NULL
// if not found. resp must point at the start of headers (after status line).
static const char *wss_find_header(const char *resp, size_t resp_len, const char *name, size_t *out_value_len) {
    size_t name_len = strlen(name);
    for (size_t i = 0; i + name_len < resp_len; ) {
        // Match "<name>:" case-insensitively at start of line.
        bool match = true;
        for (size_t j = 0; j < name_len; j++) {
            char a = resp[i + j];
            char b = name[j];
            // ASCII tolower
            if (a >= 'A' && a <= 'Z') a = (char)(a - 'A' + 'a');
            if (b >= 'A' && b <= 'Z') b = (char)(b - 'A' + 'a');
            if (a != b) { match = false; break; }
        }
        if (match && i + name_len < resp_len && resp[i + name_len] == ':') {
            // Skip colon + LWS.
            size_t v = i + name_len + 1;
            while (v < resp_len && (resp[v] == ' ' || resp[v] == '\t')) v++;
            // Find CRLF.
            size_t e = v;
            while (e + 1 < resp_len && !(resp[e] == '\r' && resp[e+1] == '\n')) e++;
            *out_value_len = e - v;
            return resp + v;
        }
        // Advance to next line.
        while (i + 1 < resp_len && !(resp[i] == '\r' && resp[i+1] == '\n')) i++;
        i += 2;
    }
    return NULL;
}


SignalingHandle signaling_connect(const char *signed_url) {
    if (NULL == signed_url) {
        return NULL;
    }
    if (g_sig.connected) {
        printf("[signaling] signaling_connect called while already connected\n");
        return NULL;
    }

    char *host = NULL;
    const char *path = NULL;
    if (0 != wss_url_split(signed_url, &host, &path)) {
        return NULL;
    }

