avnet-iotconnect/avnet-iotc-mtb-psoc-edge-aivision-webrtc/proj_cm33_ns/webrtc/signaling.c
    // 1. Generate Sec-WebSocket-Key: 16 random bytes, base64-encoded.
    uint8_t nonce[WSS_NONCE_LEN];
    if (0 != webrtc_csprng_bytes(nonce, sizeof(nonce))) {
        printf("[signaling] csprng failed for Sec-WebSocket-Key\n");
        free(host);
        return NULL;
    }
    char nonce_b64[WSS_NONCE_B64_LEN];
    size_t nonce_b64_len = 0;
    if (0 != mbedtls_base64_encode((unsigned char *) nonce_b64, sizeof(nonce_b64), &nonce_b64_len, nonce, sizeof(nonce))) {
        printf("[signaling] base64 encode failed for Sec-WebSocket-Key\n");
        free(host);
        return NULL;
    }
    nonce_b64[nonce_b64_len] = '\0';

    // 2. Open TLS connection to host:443. Cert verify against AmazonRootCA1.
    cy_awsport_server_info_t server_info = {
        .host_name = host,
        .port      = WSS_PORT,
    };
    cy_awsport_ssl_credentials_t ssl = {
        .root_ca           = (const char *) IOTCL_AMAZON_ROOT_CA1,
        .root_ca_size      = strlen(IOTCL_AMAZON_ROOT_CA1) + 1,
        .root_ca_verify_mode = CY_AWS_ROOTCA_VERIFY_REQUIRED,
        .sni_host_name     = host,
        .sni_host_name_size = strlen(host) + 1,
    };

    cy_rslt_t r = cy_awsport_network_create(&g_sig.net_ctx, &server_info, &ssl, NULL, NULL);
    if (CY_RSLT_SUCCESS != r) {
        printf("[signaling] cy_awsport_network_create failed: 0x%08lx\n", (unsigned long) r);
        free(host);
        return NULL;
    }
    r = cy_awsport_network_connect(&g_sig.net_ctx, WSS_HANDSHAKE_SEND_TIMEOUT, WSS_HANDSHAKE_RECV_TIMEOUT);
    if (CY_RSLT_SUCCESS != r) {
        printf("[signaling] cy_awsport_network_connect failed: 0x%08lx\n", (unsigned long) r);
        cy_awsport_network_delete(&g_sig.net_ctx);
        free(host);
        return NULL;
    }

    // 3. Build the upgrade request. Size the buffer from the actual URL —
    //    presigned URLs run multi-KB once the URI-encoded session token is
    //    in there, so a fixed scratch doesn't cut it.
    size_t req_cap = strlen(path) + strlen(host) + WSS_REQ_FIXED_OVERHEAD;
    char *req = malloc(req_cap);
    if (NULL == req) {
        cy_awsport_network_disconnect(&g_sig.net_ctx);
        cy_awsport_network_delete(&g_sig.net_ctx);
        free(host);
        return NULL;
    }
    int req_len = snprintf(req, req_cap,
        "GET %s HTTP/1.1\r\n"
        "Host: %s\r\n"
        "Upgrade: websocket\r\n"
        "Connection: Upgrade\r\n"
        "Sec-WebSocket-Key: %s\r\n"
        "Sec-WebSocket-Version: 13\r\n"
        "\r\n",
        path, host, nonce_b64
    );
    if (req_len <= 0 || (size_t) req_len >= req_cap) {
        printf("[signaling] WSS upgrade request did not fit in %d bytes\n", (int) req_cap);
        free(req);
        cy_awsport_network_disconnect(&g_sig.net_ctx);
        cy_awsport_network_delete(&g_sig.net_ctx);
        free(host);
        return NULL;
    }

    int32_t sent = cy_awsport_network_send(&g_sig.net_ctx, req, (size_t) req_len);
    free(req);
    if (sent != req_len) {
        printf("[signaling] WSS upgrade send short/failed: %d/%d\n", (int) sent, req_len);
        cy_awsport_network_disconnect(&g_sig.net_ctx);
        cy_awsport_network_delete(&g_sig.net_ctx);
        free(host);
        return NULL;
    }

    // 4. Receive the response head.
    uint8_t resp[WSS_RESP_BUF_LEN];
    int resp_len = wss_recv_head(&g_sig.net_ctx, resp, sizeof(resp));
    if (resp_len < 0) {
        cy_awsport_network_disconnect(&g_sig.net_ctx);
        cy_awsport_network_delete(&g_sig.net_ctx);
        free(host);
        return NULL;
    }

    // 5. Verify status line is "HTTP/1.1 101".
    //    Min length of a valid 101 line is "HTTP/1.1 101 X\r\n" — 16 bytes.
    if (resp_len < 16 || 0 != memcmp(resp, "HTTP/1.1 101", 12)) {
        // Print the status line for triage.
        size_t line_end = 0;
        while (line_end + 1 < (size_t) resp_len && !(resp[line_end] == '\r' && resp[line_end+1] == '\n')) line_end++;
        printf("[signaling] WSS upgrade not 101: %.*s\n", (int) line_end, (const char *) resp);
        cy_awsport_network_disconnect(&g_sig.net_ctx);
        cy_awsport_network_delete(&g_sig.net_ctx);
        free(host);
        return NULL;
    }

    // 6. Find Sec-WebSocket-Accept and verify it matches base64(SHA1(key+GUID)).
    //    Skip the status line so the header search starts at the first header.
    size_t hdr_off = 0;
    while (hdr_off + 1 < (size_t) resp_len && !(resp[hdr_off] == '\r' && resp[hdr_off+1] == '\n')) hdr_off++;
    hdr_off += 2;
    size_t accept_len = 0;
    const char *accept_val = wss_find_header((const char *) resp + hdr_off, (size_t) resp_len - hdr_off,
                                             "Sec-WebSocket-Accept", &accept_len);
    if (NULL == accept_val) {
        printf("[signaling] WSS upgrade response missing Sec-WebSocket-Accept\n");
        cy_awsport_network_disconnect(&g_sig.net_ctx);
        cy_awsport_network_delete(&g_sig.net_ctx);
        free(host);
        return NULL;
    }
    char expected[WSS_ACCEPT_B64_LEN];
    if (0 != wss_compute_accept(nonce_b64, expected, sizeof(expected))) {
        printf("[signaling] failed to compute expected Sec-WebSocket-Accept\n");
        cy_awsport_network_disconnect(&g_sig.net_ctx);
        cy_awsport_network_delete(&g_sig.net_ctx);
        free(host);
        return NULL;
    }
    size_t expected_len = strlen(expected);
    if (accept_len != expected_len || 0 != memcmp(accept_val, expected, expected_len)) {
        printf("[signaling] Sec-WebSocket-Accept mismatch (got %.*s, want %s)\n",
            (int) accept_len, accept_val, expected);
        cy_awsport_network_disconnect(&g_sig.net_ctx);
        cy_awsport_network_delete(&g_sig.net_ctx);
        free(host);
        return NULL;
    }

    free(host);
    g_sig.connected = true;
    printf("[signaling] WS upgrade OK (101 Switching Protocols)\n");
    return &g_sig;
}

void signaling_disconnect(SignalingHandle sig) {
    if (NULL == sig || !sig->connected) {
        return;
    }
    cy_awsport_network_disconnect(&sig->net_ctx);
    cy_awsport_network_delete(&sig->net_ctx);
    sig->connected = false;
}

int signaling_wait_for_offer(SignalingHandle sig, const char **out_offer) {
    (void) sig;
    printf("[signaling] signaling_wait_for_offer: STUB\n");
    if (out_offer) {
        *out_offer = NULL;
    }
    return -1;
}

int signaling_send_answer(SignalingHandle sig, const char *sdp_answer) {
    (void) sig;
    (void) sdp_answer;
    printf("[signaling] signaling_send_answer: STUB\n");
    return -1;
}
